zhengwang721/ASF/thirdparty/wireless/avr2025_mac/apps/mac/beacon/coord/main.c
	sprintf(sio_array, "Result frame with handle %" PRIu8 ": ", msduHandle);
	printf((const char *)sio_array); */
	printf(Dispaly_Result_Frame, msduHandle);
#endif

	/*Led_data is turned off after the confirmation*/
	LED_Off(LED_DATA);
	if (status == MAC_SUCCESS) {
#ifdef SIO_HUB
		printf("Success\r\n");
#endif
	} else if (status == MAC_TRANSACTION_OVERFLOW) {
#ifdef SIO_HUB
		/* Frame could not be placed into the indirect queue. */
		printf("Transaction overflow\r\n");
#endif
	} else if (status == MAC_TRANSACTION_EXPIRED) {
#ifdef SIO_HUB

		/*
		 * Frame could not be delivered to the target node within
		 * the proper time.
		 */
		printf("Transaction expired\r\n");
#endif
	}
	else
{
	printf("Error_sending_data,%d\n\r",status);
}

	/* Keep compiler happy. */
	msduHandle = msduHandle;
#ifdef ENABLE_TSTAMP
	Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}

/*
 * @brief Callback function usr_mcps_data_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param msduLength       Number of octets contained in MSDU
 * @param msdu             Pointer to MSDU
 * @param mpduLinkQuality  LQI measured during reception of the MPDU
 * @param DSN              DSN of the received data frame.
 * @param Timestamp        The time, in symbols, at which the data were received
 *                         (only if timestamping is enabled).
 */
#ifdef SIO_HUB
const char Display_Rx_Frame_Address[] = "Rx frame from Device Addr%x: ";
#endif

void usr_mcps_data_ind(wpan_addr_spec_t * SrcAddrSpec,
wpan_addr_spec_t * DstAddrSpec,
uint8_t msduLength,
uint8_t * msdu,
uint8_t mpduLinkQuality,
uint8_t DSN,
#if defined(ENABLE_TSTAMP) || defined(__DOXYGEN__)
uint32_t Timestamp,
#endif  /* ENABLE_TSTAMP */
uint8_t SecurityLevel,
uint8_t KeyIdMode,
uint8_t KeyIndex)
{
#ifdef SIO_HUB
	//char sio_array[255];

	/*sprintf(sio_array, "Rx frame from Device Addr%" PRIx16 ": ", LE16_TO_CPU_ENDIAN(
			SrcAddrSpec->Addr.short_address));
	printf(sio_array); */
	printf(Display_Rx_Frame_Address, LE16_TO_CPU_ENDIAN(
	        SrcAddrSpec->Addr.short_address));
     
	for (uint8_t i = 0; i < msduLength; i++) {		
		printf("%c", msdu[i]);
	}
	//sio_array[msduLength] = '\0';
	//printf(sio_array);
	printf("\r\n");
#endif

	/* Keep compiler happy. */
	SrcAddrSpec = SrcAddrSpec;
	DstAddrSpec = DstAddrSpec;
	msduLength = msduLength;
	msdu = msdu;
	mpduLinkQuality = mpduLinkQuality;
	DSN = DSN;
#ifdef ENABLE_TSTAMP
	Timestamp = Timestamp;
#endif  /* ENABLE_TSTAMP */
}

#if ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))

/*
 * Callback function usr_mcps_purge_conf
 *
 * @param msduHandle           Handle (id) of MSDU to be purged.
 * @param status               Result of requested purge operation.
 *
 * @return void
 *
 */
void usr_mcps_purge_conf(uint8_t msduHandle,
		uint8_t status)
{
}

#endif  /* ((MAC_PURGE_REQUEST_CONFIRM == 1) && (MAC_INDIRECT_DATA_BASIC == 1))
         **/

#if (MAC_ASSOCIATION_REQUEST_CONFIRM == 1)

/*
 * Callback function usr_mlme_associate_conf.
 *
 * @param AssocShortAddress    Short address allocated by the coordinator.
 * @param status               Result of requested association operation.
 *
 * @return void
 *
 */
void usr_mlme_associate_conf(uint16_t AssocShortAddress,
		uint8_t status)
{
	/* Keep compiler happy. */
	AssocShortAddress = AssocShortAddress;
}

#endif  /* (MAC_ASSOCIATION_REQUEST_CONFIRM == 1) */

#if (MAC_ASSOCIATION_INDICATION_RESPONSE == 1)

/*
 * @brief Callback function usr_mlme_associate_ind
 *
 * @param DeviceAddress         Extended address of device requesting
 *association
 * @param CapabilityInformation Capabilities of device requesting association
 */
void usr_mlme_associate_ind(uint64_t DeviceAddress,
		uint8_t CapabilityInformation)
{
	/*
	 * Any device is allowed to join the network.
	 * Use: bool wpan_mlme_associate_resp(uint64_t DeviceAddress,
	 *                                    uint16_t AssocShortAddress,
	 *                                    uint8_t status);
	 *
	 * This response leads to comm status indication ->
	 *usr_mlme_comm_status_ind
	 * Get the next available short address for this device.
	 */
	uint16_t associate_short_addr = macShortAddress_def;

	if (assign_new_short_addr(DeviceAddress,
			&associate_short_addr) == true) {
		wpan_mlme_associate_resp(DeviceAddress,
				associate_short_addr,
				ASSOCIATION_SUCCESSFUL);
	} else {
		wpan_mlme_associate_resp(DeviceAddress, associate_short_addr,
				PAN_AT_CAPACITY);
	}

	/* Keep compiler happy. */
	CapabilityInformation = CapabilityInformation;
}

#endif  /* (MAC_ASSOCIATION_INDICATION_RESPONSE == 1) */

#if (MAC_BEACON_NOTIFY_INDICATION == 1)

/*
 * Callback function usr_mlme_beacon_notify_ind
 *
 * @param BSN            Beacon sequence number.
 * @param PANDescriptor  Pointer to PAN descriptor for received beacon.
 * @param PendAddrSpec   Pending address specification in received beacon.
 * @param AddrList       List of addresses of devices the coordinator has
 *pending data.
 * @param sduLength      Length of beacon payload.
 * @param sdu            Pointer to beacon payload.
 *
 * @return void
 *
 */
void usr_mlme_beacon_notify_ind(uint8_t BSN,
		wpan_pandescriptor_t *PANDescriptor,
		uint8_t PendAddrSpec,
		uint8_t *AddrList,
		uint8_t sduLength,
		uint8_t *sdu)
{
}

#endif  /* (MAC_BEACON_NOTIFY_INDICATION == 1) */

#if ((MAC_ORPHAN_INDICATION_RESPONSE == 1) || \
	(MAC_ASSOCIATION_INDICATION_RESPONSE == 1))

/*
 * @brief Callback function usr_mlme_comm_status_ind
 *
 * @param SrcAddrSpec      Pointer to source address specification
 * @param DstAddrSpec      Pointer to destination address specification
 * @param status           Result for related response operation
 */
void usr_mlme_comm_status_ind(wpan_addr_spec_t *SrcAddrSpec,
		wpan_addr_spec_t *DstAddrSpec,
		uint8_t status)
{
	if (status == MAC_SUCCESS) {
		 recent_assoc_dev_no++;
		 printf("comm_status\n\r");
		 #ifdef MAC_SECURITY_ZIP
		uint8_t mac_dev_table_entries = 1;
        wpan_mlme_set_req(macDeviceTableEntries,
                          NO_PIB_INDEX,
                          &mac_dev_table_entries);
#endif
		 wpan_mlme_get_req(macKeyTable, recent_assoc_dev_no);
		/*
		 * Now the association of the device has been successful and its
		 * information, like address, could  be stored.
		 * But for the sake of simple handling it has been done
		 * during assignment of the short address within the function
		 * assign_new_short_addr()
		 */

